Revit 2024 API
ParameterTypeId.CurveWallOffsetRoofs Property
 "Overhang"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CurveWallOffsetRoofs { get; }
Visual Basic
Public Shared ReadOnly Property CurveWallOffsetRoofs As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurveWallOffsetRoofs {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace